In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To':['LoNDon_paris','MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis','Brussels_londOn'],
                   'FlightNumber':[10045,np.nan,10065,np.nan,10085],
                   'RecentDelays':[[23,47],[],[24,43,87],[13],[67,32]],
                   'Airline':['KLM(!)','<AirFrance> (12)','(British Airways. )',
                              '12. Air France', '''Swiss Air''']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []     <AirFrance> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]            Swiss Air

# Fill in the FlightNumber Columns and convert datatype to int

In [3]:
df.FlightNumber = df.FlightNumber.interpolate()
df['FlightNumber'].count()
df['FlightNumber'].astype('int')

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int32

# Splitting of From_To column to a separate dataframe

In [4]:
temp_df = df.From_To.str.split('_',n=1,expand=True)
type(temp_df)
temp_df.rename(columns={0:'From',1:'To'}, inplace=True)
print(temp_df)

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

# First letter Capitalisation of City names

In [5]:
temp_df.From = temp_df.From.str.capitalize()
temp_df.To = temp_df.To.str.capitalize()
print(temp_df)

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

# Delete the From_To Column and attach the temporary data Frame

In [6]:
#df = df.drop(columns=['From_To'], axis=1)
result=pd.concat([temp_df,df.drop(columns=['From_To'], axis=1)],axis=1)
result

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris       10045.0      [23, 47]               KLM(!)
1    Madrid      Milan       10055.0            []     <AirFrance> (12)
2    London  Stockholm       10065.0  [24, 43, 87]  (British Airways. )
3  Budapest      Paris       10075.0          [13]       12. Air France
4  Brussels     London       10085.0      [67, 32]            Swiss Air

# Breaking the list into each individual column

In [8]:
delays = pd.DataFrame(result.RecentDelays.to_list())
column_count = len(delays.columns)
for i in range(column_count):
    delays.rename(columns={i:('delay_'+ str(i))}, inplace=True)
print(delays)
result.drop(columns=['RecentDelays'], axis=1, inplace=True)
final_result = pd.concat([result,delays],axis=1)
print(final_result)

   delay_0  delay_1  delay_2
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN
       From         To  FlightNumber              Airline  delay_0  delay_1  \
0    London      Paris       10045.0               KLM(!)     23.0     47.0
1    Madrid      Milan       10055.0     <AirFrance> (12)      NaN      NaN
2    London  Stockholm       10065.0  (British Airways. )     24.0     43.0
3  Budapest      Paris       10075.0       12. Air France     13.0      NaN
4  Brussels     London       10085.0            Swiss Air     67.0     32.0

   delay_2
0      NaN
1      NaN
2     87.0
3      NaN
4      NaN